Tekla Open API Reference for Tekla Structures 2025
MaterialCatalog Constructor (String)
 Creates a new instance of the MaterialCatalog and will select the material (if available) in the tree.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MaterialCatalog(
	string Material
)
Public Sub New (
	Material As String
)
Parameters
Material
Type: System.String
The material to be selected in the dialog.
See Also
Reference
MaterialCatalog Class
MaterialCatalog Overload
Tekla.Structures.Dialog.UIControls Namespace